In [2]:
# condition with join

#list all the city names where continent is "Africa"
#select city.name from city inner join country on city.CountryCode = Country.code  and Country.Continent = 'Africa'

In [ ]:
# Group by with joins

#select Country.Continent, avg(city.population) from city inner join country on city.CountryCode = Country.code  group by Country.Continent

In [ ]:
# 2nd heighest salary

#select Country.Continent, avg(city.population) from city inner join country on city.CountryCode = Country.code  group by Country.Continent

In [3]:
#SQL---Basic Join----The Report

#usually we apply join with a condition left_table.id =  right_table.id
# here left_table.marks between right_table.min_mark and right_table.max_mark 

# select   (case
#              when g.grade>=8 then s.name
#              else 'NULL'
#              end ) as name,  g.grade , s.marks from Students as s inner join Grades as g on 
            
# s.marks between g.min_mark and g.max_mark 
# order by g.grade desc, (case 
#                         when s.name is null then s.marks
#                         else s.name
#                         end) asc

In [4]:
#SQL---Basic Join----Top Competitors

# select h.hacker_id, h.name from (((hackers as h inner join Submissions as s on h.hacker_id = s.hacker_id) inner join challenges as c on c.challenge_id = s.challenge_id) inner join 
# difficulty as d on d.difficulty_level = c.difficulty_level) where s.score=d.score
# group by h.hacker_id, h.name having count(*)>1 order by count(*) desc,h.hacker_id

In [5]:
#SQL---Basic Join----Contest Leaderboard

# select h.hacker_id ,h.name ,sum(mst.m_score) as final_score from hackers as h 
# inner join 
# (select  hacker_id as id ,max(score) as m_score  from submissions  group by hacker_id,challenge_id) as mst

# on mst.id = h.hacker_id 
# group by h.hacker_id,h.name having final_score>0 order by final_score desc, h.hacker_id asc

### **Procedures**

In [6]:
# draw the triangle 1        
#  ****
#  ***
#  **
#  *


# delimiter //
# create procedure basic_while()
# begin

#     set @i :=20;
    
#     while @i>0 do
#         select repeat('* ',@i);
#         set @i := @i -1;
#     end while;
# end//
# delimiter ;

# call basic_while()

In [7]:
#print prime numbers

# delimiter //
# create procedure list_prime()
# begin
#     create table temp
#     (var int
#     );
#     set @i :=2;
#     set @c :=0;
#     set @start :=2;
#     set @end :=1000;
    
#     while @start <=@end do   
#         while @i<=@start do
#             if  (@start %@i=0 and @start <>@i)  then set @c :=@c+1;
#             end if;
#             set @i :=@i +1;
#         end while; 
#         set @i :=2;
#         set @start := @start +1; 
        
#         if @c = 0 then  insert into temp values(@start -1); 
#         else set @c :=0;
#         end if;     
#     end while;
#     select GROUP_CONCAT(var SEPARATOR '&') from temp;
# end //
# delimiter ;

# call list_prime()

In [1]:
#sql project planning

# SET sql_mode = '';
# select Start_Date ,min(End_Date) 
# from  
# (select Start_Date from Projects where Start_Date not in (select End_Date from Projects)) as a,
# (select End_Date from Projects where End_Date not in (select Start_Date from Projects )) as b
# where Start_Date < End_Date
# group by Start_Date
# order by DATEDIFF(End_Date,Start_Date) asc, Start_Date asc;

In [3]:
# new companies

# select c.company_code, c.founder , count(distinct(e.lead_manager_code)),
# count(distinct( e.senior_manager_code)), count(distinct(e.manager_code)),count(distinct(e.employee_code)) 
# from (employee as e inner join  company as c on c.company_code = e.company_code)
# group by  c.company_code, c.founder 
# order by e.company_code